Revit 2024 API
BuiltInFailures.PerformanceFailures.DuplicateInstances Property
 There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicateInstances { get; }
Visual Basic
Public Shared ReadOnly Property DuplicateInstances As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicateInstances {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace